{
  "name": "Verifica dell'apprendimento",
  "chapters": [
    "Linguaggi regolari e analisi lessicale",
    "Linguaggi liberi da contesto e analisi sintattica",
    "Analisi semantica e tabelle dei simboli",
    "Generazione di codice intermedio",
    "Gestione della memoria"
  ],
  "books": "Riferimento principale:- Introduction to Compiler Design (Second Edition), Torben AEgidius Mogensen, Springer, 2017, 978-3319669656(Una versione preliminare del testo e' disponibile alla pagina http://hjemmesider.diku.dk/~torbenm/Basics/index.html)Testi di consultazione:- Compilers: Principles, Techniques, and Tools (2nd edition); Alfred V. Aho, Monica S. Lam, Ravi Sethi, Jeffrey D. Ullman; Prentice Hall, 2006.- Automata and computability; Dexter Kozen; Springer, 1999.- Briefly on Bottom-up; Paola Quaglia; CoRR abs/1807.05555; http://arxiv.org/abs/1807.05555; 2018.",
  "learningGoals": "Lo scopo del corso e' introdurre le nozioni fondamentali dei linguaggi formali e gli strumenti per la progettazione di compilatori di linguaggi di programmazione.I principi e le tecnologie della compilazione trovano numerose applicazioni in aree ortogonali a quella dei linguaggi di programmazione (e.g., analisi di linguaggi naturali; analisi e controllo di correttezza sintattica di query).Lo studente apprendera' tecniche ed algoritmi per la progettazione del front-end di compilatori e per la gestione e progettazione di applicazioni per l'analisi e la trasformazione di testi.",
  "methods": "Lezioni in aula.Il materiale relativo al corso, gli avvisi, etc., sono resi disponibili alla pagina Moodle del corso.Gli argomenti vengono presentati mostrando anche la loro applicazione a istanze specifiche. Gli esercizi svolti in classe sono selezionati sia per agevolare la comprensione della materia che per evidenziare strutture e soluzioni prototipali. La comprensione degli esempi e degli esercizi contribuisce in modo rilevante all'acquisizione di competenza nella materia.Attivita' di apprendimento che saranno richieste allo studente: studio delle strutture e degli algoritmi presentati in aula (conoscenza); ri-elaborazione degli argomenti e degli esempi presentati in aula (dimostrazione di padronanza della materia, competenza).",
  "examDetails": "- L'esame consiste in una prova scritta e in una prova orale.Entrambe le prove sono volte a verificare sia l'ampiezza che la profondita' delle conoscenze acquisite.- L'esame scritto e' \"closed books\" e \"no electronics\" (libri, appunti, etc., cellulari, palmari, etc. non sono ammessi) e consiste di 10 domande aperte che prevedono risposte sintetiche. Ciascuna risposta viene valutata 3/30 se corretta e 0/30 altrimenti.- All'esame orale sono ammessi solo i candidati che hanno ottenuto un voto di almeno 18/30 allo scritto. All'orale vengono poste domande che prevedono risposte discorsive o richiedono lo svolgimento di esercizi di ri-elaborazione degli argomenti appresi.- Il voto finale e' determinato dalla media dei voti ottenuti nella prova scritta (50%) e in quella orale (50%). La lode e' attribuita a chi, avendo superato lo scritto con 30/30, supera l'esame orale in modo eccellente.- L'iscrizione su esse3 e' obbligatoria ed e' responsabilita' dello studente. L'eventuale cancellazione dell'iscrizione e' anch'essa responsabilita' dello studente interessato. In caso di iscrizione e no-show lo studente non e' ammesso all'appello successivo.- La verbalizzazione dell'esame avviene al completamento dell'appello. Si consiglia di rispettare la propedeuticita' del test di inglese B1 e di tenere in considerazione il relativo warning emesso da esse3 al momento dell'iscrizione all'esame."
}