{
  "name": "[135007] - Psicologia sociale",
  "chapters": [
    {
      "name": "La psicologia sociale",
      "sections": [
        "campi e metodi di indagine"
      ]
    },
    {
      "name": "La cognizione sociale",
      "sections": []
    },
    {
      "name": "La percezione degli altri",
      "sections": [
        "prime impressioni e processi di attribuzione"
      ]
    },
    {
      "name": "Il sé",
      "sections": []
    },
    {
      "name": "Atteggiamenti e persuasione",
      "sections": []
    },
    {
      "name": "Influenza sociale",
      "sections": []
    },
    {
      "name": "Processi di gruppo",
      "sections": []
    },
    {
      "name": "Pregiudizio, stereotipi e discriminazione",
      "sections": []
    },
    {
      "name": "Aggressività",
      "sections": []
    },
    {
      "name": "Comportamento prosociale",
      "sections": []
    }
  ],
  "books": "Bibliografia (per studenti/esse di sociologia)1) E. Aronson, T. Wilson, & S. Sommers (2019). Psicologia sociale. Il Mulino (escluso Cap. IX)2) un approfondimento a scelta tra i seguenti temi.Mascolinità - Pacilli, M. G. (2020). Uomini duri: il lato oscuro della mascolinità. Il mulino.Pregiudizio - Brambilla, M. e Sacchi, S. (a cura di) (2022). Psicologia sociale del pregiudizio. Raffaello Cortina Editore. Parte 1 e Parte 2, + due capitoli a scelta della Parte 3, 4 o 5.Altri temi verranno indicati nel corso delle lezioni per le studentesse e studenti che frequenteranno in modo continuativo le lezioni.3) Eventuale altro materiale indicato a lezione e messo a disposizione dalla docente sulla comunità online moodle del corso.Nel caso si ritenesse il testo E. Aronson, T. Wilson, & S. Sommers (2019). Psicologia sociale. Il Mulino non sufficientemente dettagliato si può consultare Myers, D. G., Twenge, J. M., Marta, E., Pozzi, M. (ed.), Psicologia Sociale, 3 ed., McGraw-Hill Education (Italy)Gli studenti e le studentesse appartenenti ad altri corsi di Laurea che intendono sostenere questo esame, sono pregati/e di contattare la docente (almeno due mesi prima dell'esame) per definire un programma di esame e relativa bibliografia.",
  "learningGoals": "Il principale obiettivo del corso è quello di fornire alle studentesse e agli studenti in sociologia delle nozioni e conoscenze di base in psicologia sociale che possono essere utilizzate come strumenti di analisi dei fenomeni sociali anche complessi.In particolare, durante le lezioni e attraverso lo studio individuale, le studentesse e gli studenti dovrebbero conseguire i seguenti risultati formativi:- aver acquisito una buona conoscenza (ad es. quali sono gli antecedenti? quali le conseguenze? etc.) dei processi psicologici che hanno luogo quando gli individui si percepiscono, si influenzano e interagiscono tra loro;- aver acquisito una buona padronanza del linguaggio specifico della disciplina e delle teorie affrontate nel corso e nel libro di testo;- essere in grado di mettere in relazione conoscenze teoriche, ricerca empirica e realtà sociale (ad es. fornendo degli esempi dei processi e delle teorie studiate; selezionando, fra le conoscenze teoriche apprese, quelle che possono fornire degli strumenti di lettura e interpretazione di uno specifico fenomeno sociale).Inoltre, unitamente agli altri corsi, il presente dovrebbe contribuire a consolidare le capacita' di apprendimento autonomo, l'autonomia di giudizio e le abilità comunicative.",
  "methods": "I metodi didattici e le attività di apprendimento sono varie in quanto volte a facilitare il raggiungimento degli obiettivi formativi del corso sia per coloro che frequentano regolarmente le lezioni in presenza che coloro che invece affronteranno i corsi con altre modalità.I metodi didattici e le attività di apprendimento includono:- lezioni in presenza con attività di confronto, discussione e apprendimento attivo- lezioni frontali in presenza- audio/video lezioni su alcuni temi affrontati nelle lezioni da usufruire in asincrono- leggere, comprendere e studiare i libri di testo e altro materiale fornito a lezione;- altre attività formative a scelta (ad es. partecipazione a ricerche, relazioni, etc.)- forum sulla comunità moodleMaggiori informazioni sul programma delle lezioni, le modalità didattiche e l'organizzazione del corso verrano date nella prima lezione e comunicate nella comunità online Moodle del corso, a cui è utile iscriversi da subito.Si chiede di leggere i capitoli relativamente agli argomenti trattati prima della lezione (seguire le indicazioni su didattica online durante il corso). Questo permette di apprendere meglio dalle lezioni stesse e rende più facile la partecipazione alla discussione in aula.",
  "examDetails": "L'esame consiste in una prova scritta che può essere seguita, a discrezione dello/a studente, da un breve colloquio orale che si tiene il giorno stesso (generalmente nel pomeriggio). L’intenzione di sostenere l’orale va comunicata alla docente al momento dell’iscrizione o il giorno dell’esame scritto, prima di prendere visione delle domande. La prova scritta consiste in 4 domande aperte volte a verificare il conseguimento dei principali risultati formativi del corso ovvero le conoscenze acquisite e la capacità di mettere in relazione nozioni teoriche e interpretazione di fenomeni sociali. Ognuna di queste domande ha un peso equivalente nella valutazione finale. I criteri di valutazione delle domande aperte sono: (a) la completezza della risposta, intesa come pertinenza e accuratezza delle informazioni riportate; (b) l'uso appropriato del linguaggio proprio della disciplina; (c) la validità dell'argomentazione, e in particolare la capacità di definire antecedenti e conseguenze di un fenomeno; (d) l'efficacia comunicativa, espositiva e di sintesi.Nel corso delle lezioni verranno proposte delle ulteriori attività per la valutazione dell'apprendimento (ad es. redigere una breve relazione scritta su un tema di approfondimento). Queste attività sono rivolte alle studentesse e gli studenti che seguono le lezioni regolarmente. La partecipazione a queste attività sono su base volontaria, vanno concordate con la docente e non sostituiscono l'esame scritto.Maggiori informazioni su queste attività e anche sulle modalità di esame vengono comunicate nel sito della comunità online di moodle del corso."
}